//正则的语法概述和修饰符（g全局,i忽略大小写,m包含换行

//正则表达式在线分析工具 
//https://regexper.com/
//https://regex101.com/ 


//元字符：1 3  5 a b c 等

//转义字符：\t 、\v、\n、\r、\0、\f、\cX

//与\相关的预定义特殊字符：\d、\D、\w、\W、\s、\S、\b 、\B（注意大小写的含义）


//正则表达式特殊字符 一 （字符类）
//[ ]代表字符类，如[abc]代表abc中的任意一个字符，可以配合范围符号-如[a-c3-9]
//[^ ]代表字符类取反，如[^abc]代表非abc中的任意一个字符

//一个 - 代表范围，如[a-z] 、[a-z0-9A-Z]

//一个 . 代表一个除了回车和换行符之外的所有字符 等效于[^\r\n]，（注意与*的区别和含义）
//正则表达式特殊字符 二 （边界相关）

//边界字符 ^ $ \b \B （注意^代表的意义与在[ ]中代表的意义不同）

//正则表达式特殊字符 三 （量词）
//？出现0次或1次（最多1次）  +出现1次或多次（至少1次）   *出现0次或多次（任意次）
//{n} 出现n次       {n,m} 出现n到m次      {n,}出现至少n次
